local wurong = fk.CreateSkill{
  name = "m_ex__wurong",
}

Fk:loadTranslationTable{
  ["m_ex__wurong"] = "怃戎",
  [":m_ex__wurong"] = "出牌阶段限一次，你可以与一名其他角色谋弈，根据双方选择的结果：<br>"..
  "镇压-反抗，你对其造成1点伤害，然后你摸一张牌。<br>"..
  "镇压-归顺，你获得其一张牌，然后交给其两张牌。<br>"..
  "安抚-反抗，你受到1点伤害，然后你摸一张牌。<br>"..
  "安抚-归顺，其交给你两张牌，若其牌数不足两张，则改为跳过其下一个摸牌阶段。",

  ["#m_ex__wurong"] = "怃戎：与一名其他角色谋弈",
  ["wurong-zhenya"] = "镇压",
  ["wurong-anfu"] = "安抚",
  ["wurong-fankang"] = "反抗",
  ["wurong-guishun"] = "归顺",
  [":wurong-zhenya"] = "对方选择“反抗”，你对其造成1点伤害，然后你摸一张牌<br>对方选择“归顺”，你获得其一张牌，然后交给其两张牌",
  [":wurong-anfu"] = "对方选择“反抗”，你受到1点伤害，然后你摸一张牌<br>对方选择“归顺”，其交给你两张牌，若其牌数不足两张，改为跳过其下一个摸牌阶段",
  [":wurong-fankang"] = "对方选择“镇压”，其对你造成1点伤害，然后其摸一张牌<br>对方选择“安抚”，其受到1点伤害，然后其摸一张牌",
  [":wurong-guishun"] = "对方选择“镇压”，其获得你一张牌，然后其交给你两张牌<br>对方选择“安抚”，你交给其两张牌，若你牌数不足两张，改为跳过你下一个摸牌阶段",
  ["#m_ex__wurong-prey"] = "怃戎：获得 %dest 一张牌",
  ["#m_ex__wurong-give"] = "怃戎：请交给 %dest 两张牌",
  ["@@m_ex__wurong_skip"] = "跳过摸牌",

  ["$m_ex__wurong1"] = "平乱羌，怃蛮夷，开旧道，复驿亭！",
  ["$m_ex__wurong2"] = "识断明果，以肃越巂千里蛮疆！",
  ["$m_ex__wurong3"] = "蛮不从化，化不及蛮，此嶷之过也。",
}

return wurong
